orgslides.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>orgslides.org</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="orgslides.org"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-14 Sun"/>
<meta name="author" content="Robert Syme"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link href='http://fonts.googleapis.com/css?family=Lora:400,700' rel='stylesheet' type='text/css'><link rel="stylesheet" type="text/css" href="css/slides.css" /><link rel="stylesheet" type="text/css" href="css/src-styles.css" />
</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">orgslides.org</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction</a></li>
<li><a href="#sec-2">2 Results</a>
<ul>
<li><a href="#sec-2-1">2.1 Embedding HTML</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Usage</a>
<ul>
<li><a href="#sec-3-1">3.1 Installing Orgslides</a></li>
<li><a href="#sec-3-2">3.2 Extending Orgslides</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">


<p>
  Orgslides is a simple dart library.
</p>
<p>
  Orgslides is also available compiled down to javascript.
</p>
<p>
  Orgslides turns your orgmode html output into magical unicorn html
  presentations.
</p>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Results</h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Embedding HTML</h3>
<div class="outline-text-3" id="text-2-1">




     <iframe width="560" height="315" src="http://www.youtube.com/embed/dmJmRHDnhZo?list=UUVSMzwfN7kjQs_7_bMUuPmw&amp;hl=en_GB" frameborder="0" allowfullscreen></iframe>

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Usage</h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Installing Orgslides</h3>
<div class="outline-text-3" id="text-3-1">

<p>  Just add this file to your .org file:
</p>



<pre class="example">Org example goes here
</pre>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Extending Orgslides</h3>
<div class="outline-text-3" id="text-3-2">


<p>
   There slides work for me, but you'll almost certainly want to
   hack around a bit.
</p>


</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-10-14 Sun</p>
<p class="author">Author: Robert Syme</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.1 with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
